CSI API ETABS v1

# cDesignConcreteGetRebarPrefsBeam Method

---

Retrieves data from the Rebar Selection Rules for Beams

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetRebarPrefsBeam(
    	int Item,
    	ref string Value
    )

    Function GetRebarPrefsBeam (
    	Item As Integer,
    	ByRef Value As String
    ) As Integer

    Dim instance As cDesignConcrete
    Dim Item As Integer
    Dim Value As String
    Dim returnValue As Integer

    returnValue = instance.GetRebarPrefsBeam(Item,
    	Value)

    int GetRebarPrefsBeam(
    	int Item,
    	String^% Value
    )

    abstract GetRebarPrefsBeam :
            Item : int *
            Value : string byref -> int

#### Parameters

Item

    Type: SystemInt32
An integer value corresponding to the data to be retrieved, from the following
list

  1. Non-Seismic Smallest Longitudinal Bar Size Top
  2. Non-Seismic Largest Longitudinal Bar Size Top
  3. Non-Seismic Preferred Longitudinal Bar Size Top
  4. Non-Seismic Min Number of Bars Top
  5. Non-Seismic Smallest Longitudinal Bar Size Bottom
  6. Non-Seismic Largest Longitudinal Bar Size Bottom
  7. Non-Seismic Preferred Longitudinal Bar Size Bottom
  8. Non-Seismic Min Number of Bars Bottom
  9. Non-Seismic Smallest Stirrup Bar Size
  10. Non-Seismic Largest Stirrup Bar Size
  11. Non-Seismic Stirrup Min Spacing
  12. Non-Seismic Stirrup Max Spacing
  13. Seismic Smallest Longitudinal Bar Size Top
  14. Seismic Largest Longitudinal Bar Size Top
  15. Seismic Preferred Longitudinal Bar Size Top
  16. Seismic Min Number of Bars Top
  17. Seismic Smallest Longitudinal Bar Size Bottom
  18. Seismic Largest Longitudinal Bar Size Bottom
  19. Seismic Preferred Longitudinal Bar Size Bottom
  20. Seismic Min Number of Bars Bottom
  21. Seismic Smallest Stirrup Bar Size
  22. Seismic Largest Stirrup Bar Size
  23. Seismic Stirrup Min Spacing
  24. Seismic Stirrup Max Spacing

Value

    Type: SystemString
The retrieved data; note that numerical values are converted to String

#### Return Value

Type: Int32
Returns zero if the data is successfully retrieved; otherwise returns non-zero

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1
           Dim Value as String

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

       'retrieve rebar data
           ret = SapModel.File.GetRebarPrefsBeam(2, Value)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cDesignConcrete Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com